stress_review_post.yml
config:
  target: 'http://127.0.0.1:2106'
  phases:
    - duration: 10
      arrivalRate: 1000
  processor: "helpers/converter.js"
  variables:
    id:
      - "1"
scenarios:
  - flow:
    # - loop:
      - get:
          url: "/api/product/{{ id }}"
          beforeRequest: "convertIDToInt"
          json:
            id: "{{ id }}"
      # count: 2
            # - get:
    #     url: "/api/reviews/:id"
    # - post:
    #     url: "/api/reviews/"
    #     body: 
    # - post:
    #     url: "/api/product/:name"